#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks.data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.data.aws_caller_identity.current: Reading...
data.aws_ami.amazon-linux-2023: Reading...
aws_key_pair.deployer: Refreshing state... [id=flask-key]
data.aws_caller_identity.current: Reading...
aws_route53_zone.main: Refreshing state... [id=Z0606165CTNX3CBLI257]
aws_iam_role.role: Refreshing state... [id=flask-role]
aws_ecr_repository.ecr: Refreshing state... [id=flask]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/flask-cluster/cluster]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
data.aws_iam_policy.admin_access: Reading...
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=618012222333]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-08529a3490fe4f448]
data.aws_caller_identity.current: Read complete after 0s [id=618012222333]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Read complete after 0s [id=618012222333]
module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Read complete after 0s [id=aws]
aws_iam_role.role2: Refreshing state... [id=eks-role]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=618012222333]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::618012222333:user/cloud_user]
module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks_managed_node_group["general"].aws_iam_role.this[0]: Refreshing state... [id=general-eks-node-group-20240121145020406400000002]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=flask-cluster-cluster-20240121145020409000000003]
data.aws_iam_policy.admin_access: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.admin-role-policy-attach: Refreshing state... [id=flask-role-20240121145021097000000007]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=general-eks-node-group-20240121145020406400000002-20240121145021096200000006]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=general-eks-node-group-20240121145020406400000002-20240121145021049700000005]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=general-eks-node-group-20240121145020406400000002-20240121145021049600000004]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=flask-cluster-cluster-20240121145020409000000003-20240121145021336400000009]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=flask-cluster-cluster-20240121145020409000000003-20240121145021329000000008]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=960463405]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=099d57cd-517e-40c5-b91c-47cb36097b4c]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::618012222333:policy/flask-cluster-cluster-ClusterEncryption2024012114503935440000000c]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/flask-cluster]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=flask-cluster-cluster-20240121145020409000000003-2024012114503976970000000d]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05042d68fb7c3de60]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-080803b2d0e78a0ea]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0853057a8d7bfc941]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0dab7e322aa5d6017]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04f36490e61d1c6f4]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d26583fc62afe240]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-07016d1a31f602e6b]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08d451209deb769fa]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0941ba2c84c2d6261]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-069e58765e0b660d5]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0635ab451119cd0b9]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-081970d2d6e6f2b5f]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ae91e0171396308b]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02836ad7be7b51976]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0de3db774dc31bc33]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0e78a6b32e54e5eeb]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-042f8b1909a1b20fb]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0a72840bf77c2c631]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-016c3dd93abb3de27]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01b608cdc23285e54]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05d783590263097b4]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08d451209deb769fa1080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0f956df0c51ffda02]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3610390599]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-2997835909]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-384891754]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-221015024]
data.aws_ami.amazon-linux-2023: Read complete after 0s [id=ami-0cb6fec6f40971379]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1542137090]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-64580535]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-510678993]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1723385382]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1770870843]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-990419078]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d3731af99354aa73]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a4cc73a22fe7f2c2]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a1620bcadb53519d]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3803728176]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-0f671889077d66e27]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-099f1695037fb2da6]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0992a23a4eb06e0d8]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-080803b2d0e78a0ea1080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-0853057a8d7bfc9411080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-04f36490e61d1c6f41080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=flask-cluster]
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-01-21T15:00:23Z]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
data.aws_eks_cluster_auth.default: Reading...
module.eks.aws_eks_identity_provider_config.this["sts"]: Refreshing state... [id=flask-cluster:sts]
data.aws_eks_cluster_auth.default: Read complete after 0s [id=flask-cluster]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=5933588ce34e24e9fb40c3565fb0b5993639df67]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::618012222333:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/0A776C86FE1788F86268EC98CADAD32F]
module.eks.module.eks_managed_node_group["general"].aws_launch_template.this[0]: Refreshing state... [id=lt-0c25c33cbdab73007]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Refreshing state... [id=flask-cluster:general-20240121150024429700000014]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=flask-cluster:coredns]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=flask-cluster:kube-proxy]
module.eks.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=flask-cluster:vpc-cni]
module.cert_manager_irsa_role.data.aws_caller_identity.current: Reading...
module.cert_manager_irsa_role.data.aws_partition.current: Reading...
module.external_dns_irsa_role.data.aws_iam_policy_document.external_dns[0]: Reading...
module.external_dns_irsa_role.data.aws_partition.current: Reading...
module.external_dns_irsa_role.data.aws_region.current: Reading...
module.external_dns_irsa_role.data.aws_caller_identity.current: Reading...
module.cert_manager_irsa_role.data.aws_region.current: Reading...
module.external_dns_irsa_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.cert_manager_irsa_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.cert_manager_irsa_role.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.external_dns_irsa_role.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.external_dns_irsa_role.data.aws_iam_policy_document.external_dns[0]: Read complete after 0s [id=3286526935]
module.external_dns_irsa_role.aws_iam_policy.external_dns[0]: Refreshing state... [id=arn:aws:iam::618012222333:policy/AmazonEKS_External_DNS_Policy-20240121150713042000000019]
module.cert_manager_irsa_role.data.aws_caller_identity.current: Read complete after 1s [id=618012222333]
module.external_dns_irsa_role.data.aws_caller_identity.current: Read complete after 1s [id=618012222333]
module.cert_manager_irsa_role.data.aws_iam_policy_document.cert_manager[0]: Reading...
module.cert_manager_irsa_role.data.aws_iam_policy_document.this[0]: Reading...
module.external_dns_irsa_role.data.aws_iam_policy_document.this[0]: Reading...
module.cert_manager_irsa_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2612053589]
module.external_dns_irsa_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2715890399]
module.cert_manager_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=cert-manager]
module.external_dns_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=external-dns]
module.cert_manager_irsa_role.data.aws_iam_policy_document.cert_manager[0]: Read complete after 0s [id=4149159276]
module.cert_manager_irsa_role.aws_iam_policy.cert_manager[0]: Refreshing state... [id=arn:aws:iam::618012222333:policy/AmazonEKS_Cert_Manager_Policy-2024012115071304490000001a]
module.external_dns_irsa_role.aws_iam_role_policy_attachment.external_dns[0]: Refreshing state... [id=external-dns-2024012115071379360000001b]
module.cert_manager_irsa_role.aws_iam_role_policy_attachment.cert_manager[0]: Refreshing state... [id=cert-manager-2024012115071380380000001c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.cert-manager will be created
  + resource "helm_release" "cert-manager" {
      + atomic                     = true
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.13.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "cert-manager"
        }
    }

  # helm_release.external_dns will be created
  + resource "helm_release" "external_dns" {
      + atomic                     = false
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "6.13.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "domainFilters"
          + value = "{ev4o.com}"
        }
      + set {
          + name  = "provider"
          + value = "aws"
        }
      + set {
          + name  = "registry"
          + value = "txt"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "external-dns"
        }
      + set {
          + name  = "sources"
          + value = "{ingress}"
        }
      + set {
          + name  = "txtOwnerId"
          + value = "Owner"
        }
      + set {
          + name  = "txtPrefix"
          + value = "prefix"
        }
    }

  # helm_release.nginx-ingress will be created
  + resource "helm_release" "nginx-ingress" {
      + atomic                     = true
      + chart                      = "nginx-ingress-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "9.7.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "publishService.enabled"
          + value = "true"
        }
      + set {
          + name  = "service.type"
          + value = "LoadBalancer"
        }
    }

  # kubernetes_service_account.cert-account will be created
  + resource "kubernetes_service_account" "cert-account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "eks.amazonaws.com/role-arn"               = "arn:aws:iam::618012222333:role/cert-manager"
              + "eks.amazonaws.com/sts-regional-endpoints" = "true"
            }
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/component" = "cert-manager"
              + "app.kubernetes.io/name"      = "cert-manager"
            }
          + name             = "cert-manager"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.dns-account will be created
  + resource "kubernetes_service_account" "dns-account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "eks.amazonaws.com/role-arn"               = "arn:aws:iam::618012222333:role/external-dns"
              + "eks.amazonaws.com/sts-regional-endpoints" = "true"
            }
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/component" = "external-dns"
              + "app.kubernetes.io/name"      = "external-dns"
            }
          + name             = "external-dns"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @eevlogiev, Action: `pull_request`*